#! /bin/bash


echo =================================== 开始 ===================================
echo ===========================================================================
echo ===========================================================================


echo 开始编译生成Summary.md的脚本...

javac GenericSummary.java



echo 编译生成Summary.md的脚本完成...

echo 开始生成Summary.md文件...

java GenericSummary ../

echo 生成Summary.md文件成功...

echo ===========================================================================

cd ..

echo 开始构建gitbook文件...
gitbook build
echo 构建gitbook文件完成...

echo ...........................
echo ...........................
echo ......... 完成 ............
